<a href="https://colab.research.google.com/github/lizarani978/Python/blob/master/Multiclass_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [16]:
import pandas as pd
import numpy as np

In [17]:
df = pd.read_csv('train.csv', index_col=None)

In [18]:
df.head()

       ID  Gender Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809    Male           No  ...          4.0  Cat_4            D
1  462643  Female          Yes  ...          3.0  Cat_4            A
2  466315  Female          Yes  ...          1.0  Cat_6            B
3  461735    Male          Yes  ...          2.0  Cat_6            B
4  462669  Female          Yes  ...          6.0  Cat_6            A

[5 rows x 11 columns]

In [19]:
df.isnull().sum()

ID                   0
Gender               0
Ever_Married       140
Age                  0
Graduated           78
Profession         124
Work_Experience    829
Spending_Score       0
Family_Size        335
Var_1               76
Segmentation         0
dtype: int64

In [20]:
df['Ever_Married'] = df['Ever_Married'].fillna(df['Ever_Married'].mode()[0])

In [21]:
df['Profession'] = df['Profession'].fillna(df['Profession'].mode()[0])

In [22]:
df['Graduated'] = df['Graduated'].fillna(df['Graduated'].mode()[0])

In [23]:
df['Work_Experience'] = df['Work_Experience'].fillna(df['Work_Experience'].mode()[0])

In [24]:
df['Family_Size'] = df['Family_Size'].fillna(df['Family_Size'].mode()[0])

In [25]:
df['Var_1'] = df['Var_1'].fillna(df['Var_1'].mode()[0])

In [26]:
df.isnull().sum()

ID                 0
Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
Segmentation       0
dtype: int64

In [27]:
df.dtypes

ID                   int64
Gender              object
Ever_Married        object
Age                  int64
Graduated           object
Profession          object
Work_Experience    float64
Spending_Score      object
Family_Size        float64
Var_1               object
Segmentation        object
dtype: object

In [28]:
#get dummies
df.Gender = pd.get_dummies(df.Gender)
df.head(5)

       ID  Gender Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809       0           No  ...          4.0  Cat_4            D
1  462643       1          Yes  ...          3.0  Cat_4            A
2  466315       1          Yes  ...          1.0  Cat_6            B
3  461735       0          Yes  ...          2.0  Cat_6            B
4  462669       1          Yes  ...          6.0  Cat_6            A

[5 rows x 11 columns]

In [29]:
#get dummies
df.Ever_Married = pd.get_dummies(df.Ever_Married)
df.head(5)

       ID  Gender  Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809       0             1  ...          4.0  Cat_4            D
1  462643       1             0  ...          3.0  Cat_4            A
2  466315       1             0  ...          1.0  Cat_6            B
3  461735       0             0  ...          2.0  Cat_6            B
4  462669       1             0  ...          6.0  Cat_6            A

[5 rows x 11 columns]

In [30]:
#get dummies
df.Graduated = pd.get_dummies(df.Graduated)
df.head(5)

       ID  Gender  Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809       0             1  ...          4.0  Cat_4            D
1  462643       1             0  ...          3.0  Cat_4            A
2  466315       1             0  ...          1.0  Cat_6            B
3  461735       0             0  ...          2.0  Cat_6            B
4  462669       1             0  ...          6.0  Cat_6            A

[5 rows x 11 columns]

In [31]:
#LABEL ENCODER
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
df['Spending_Score'] = le.fit_transform(df['Spending_Score'])
df.head(5)

       ID  Gender  Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809       0             1  ...          4.0  Cat_4            D
1  462643       1             0  ...          3.0  Cat_4            A
2  466315       1             0  ...          1.0  Cat_6            B
3  461735       0             0  ...          2.0  Cat_6            B
4  462669       1             0  ...          6.0  Cat_6            A

[5 rows x 11 columns]

In [32]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
df['Profession'] = le.fit_transform(df['Profession'])
df.head(5)

       ID  Gender  Ever_Married  ...  Family_Size  Var_1  Segmentation
0  462809       0             1  ...          4.0  Cat_4             D
1  462643       1             0  ...          3.0  Cat_4             A
2  466315       1             0  ...          1.0  Cat_6             B
3  461735       0             0  ...          2.0  Cat_6             B
4  462669       1             0  ...          6.0  Cat_6             A

[5 rows x 11 columns]

In [33]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
df['Segmentation'] = le.fit_transform(df['Segmentation'])
df.head(5)

       ID  Gender  Ever_Married  ...  Family_Size  Var_1  Segmentation
0  462809       0             1  ...          4.0  Cat_4             3
1  462643       1             0  ...          3.0  Cat_4             0
2  466315       1             0  ...          1.0  Cat_6             1
3  461735       0             0  ...          2.0  Cat_6             1
4  462669       1             0  ...          6.0  Cat_6             0

[5 rows x 11 columns]

In [34]:
df.Var_1.unique()

array(['Cat_4', 'Cat_6', 'Cat_7', 'Cat_3', 'Cat_1', 'Cat_2', 'Cat_5'],
      dtype=object)

In [35]:
#mapping
df['Var_1'] = df['Var_1'].replace(('Cat_1','Cat_2','Cat_3','Cat_4','Cat_5','Cat_6','Cat_7'),(1,2,3,4,5,6,7))
df.head()

       ID  Gender  Ever_Married  ...  Family_Size  Var_1  Segmentation
0  462809       0             1  ...          4.0      4             3
1  462643       1             0  ...          3.0      4             0
2  466315       1             0  ...          1.0      6             1
3  461735       0             0  ...          2.0      6             1
4  462669       1             0  ...          6.0      6             0

[5 rows x 11 columns]

In [36]:
df.corr()

                       ID    Gender  ...     Var_1  Segmentation
ID               1.000000 -0.006155  ... -0.001955     -0.009104
Gender          -0.006155  1.000000  ... -0.029660     -0.026403
Ever_Married    -0.022892  0.111732  ... -0.076450      0.213730
Age             -0.005055 -0.030216  ...  0.167332     -0.243552
Graduated        0.009377 -0.033206  ... -0.120044      0.178683
Profession      -0.000263 -0.025079  ... -0.039314      0.202919
Work_Experience -0.018627  0.057212  ...  0.025826      0.008216
Spending_Score  -0.018949  0.054261  ... -0.032833      0.100572
Family_Size      0.012601 -0.057920  ... -0.137801      0.185486
Var_1           -0.001955 -0.029660  ...  1.000000     -0.018339
Segmentation    -0.009104 -0.026403  ... -0.018339      1.000000

[11 rows x 11 columns]

In [37]:
corr_matrix = abs(df.corr())
print(corr_matrix["Segmentation"].sort_values(ascending=False))

Segmentation       1.000000
Age                0.243552
Ever_Married       0.213730
Profession         0.202919
Family_Size        0.185486
Graduated          0.178683
Spending_Score     0.100572
Gender             0.026403
Var_1              0.018339
ID                 0.009104
Work_Experience    0.008216
Name: Segmentation, dtype: float64

In [38]:
x = df.drop(['ID','Segmentation'],axis=1)
y = df['Segmentation']

In [39]:
y

0       3
1       0
2       1
3       1
4       0
       ..
8063    3
8064    3
8065    3
8066    1
8067    1
Name: Segmentation, Length: 8068, dtype: int64

In [40]:
from sklearn.ensemble import RandomForestRegressor
regressor = RandomForestRegressor(n_estimators=300)

In [41]:
regressor.fit(x, y)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=300, n_jobs=None, oob_score=False,
                      random_state=None, verbose=0, warm_start=False)

In [42]:
print("Accuracy :", regressor.score(x,y))

Accuracy : 0.8482585958734669

In [43]:
x.head()

   Gender  Ever_Married  Age  ...  Spending_Score  Family_Size  Var_1
0       0             1   22  ...               2          4.0      4
1       1             0   38  ...               0          3.0      4
2       1             0   67  ...               2          1.0      6
3       0             0   67  ...               1          2.0      6
4       1             0   40  ...               1          6.0      6

[5 rows x 9 columns]

In [44]:
print("Segmentation is",regressor.predict([[1	,0	,32,1,	5,	3	,2,	4.0	,4]])[0].astype(int))

Segmentation is 1